<?xml version="1.0" ?><policyDefinitionResources revision="1.0" schemaVersion="1.0" xmlns="http://www.microsoft.com/GroupPolicy/PolicyDefinitions"><!--microsoft_edge version: 133.0.3065.69--><displayName/><description/><resources><stringTable><string id="WebView2LoaderOverrideSettings_group">Configuración de invalidación de cargador</string><string id="BrowserExecutableFolder">Configurar la ubicación de la carpeta ejecutable del explorador</string><string id="BrowserExecutableFolder_Explain">Esta directiva configura las aplicaciones de WebView2 para usar el tiempo de ejecución WebView2 en la ruta de acceso especificada. La carpeta debe contener los siguientes archivos: msedgewebview2.exe, msedge.dll, etc.

Para establecer el valor para la ruta de acceso de la carpeta, especifique un nombre de valor y un par de valor. Configure el nombre de valor en el Id. del modelo de usuario de la aplicación o el nombre del archivo ejecutable. Puede usar el carácter comodín &quot;*&quot; como nombre de valor para aplicarlo a todas las aplicaciones.

Valor de ejemplo:

Name: *, Value: C:\Program Files\Microsoft Edge WebView2 Runtime Redistributable 85.0.541.0 x64</string><string id="BrowserExecutableFolderDesc">Configurar la ubicación de la carpeta ejecutable del explorador</string><string id="ChannelSearchKind">Configurar el tipo de búsqueda del canal de versión WebView2</string><string id="ChannelSearchKind_Explain">Esta directiva configura el tipo de búsqueda de canal para las aplicaciones WebView2. De forma predeterminada, el tipo de búsqueda de canal es 0, que es equivalente al tipo de búsqueda &quot;Más estable&quot; en la API WebView2 correspondiente; Esto indica que la creación del entorno WebView2 debe buscar un canal de versión de la más a la menos estable: WebView2 Runtime, Beta, Dev y Canary.

Para invertir el orden de búsqueda predeterminado y usar el tipo de búsqueda &quot;Menos estable&quot;, establezca esta directiva en 1.

Para establecer el valor del tipo de búsqueda de canal, proporcione un par Nombre de valor y Valor. Configure el nombre de valor en el id. del modelo de usuario de la aplicación o el nombre del archivo ejecutable. Puede usar el carácter comodín &quot;*&quot; como nombre de valor para aplicar a todas las aplicaciones.

Valor de ejemplo:

Name: WebView2APISample.exe, Value: 1</string><string id="ChannelSearchKindDesc">Configurar el tipo de búsqueda del canal de versión WebView2</string><string id="ReleaseChannelPreference">Establecer las preferencias de orden de búsqueda por canales de lanzamiento (en desuso)</string><string id="ReleaseChannelPreference_Explain">EN DESUSO: esta directiva está en desuso. Actualmente se admite pero será obsoleta en una versión futura.

Esta directiva está en desuso en favor de ChannelSearchKind, que tiene la misma funcionalidad, y quedará obsoleta en la versión 124. El orden de búsqueda de canales predeterminado es WebView2 Runtime, Beta, Dev y Canary.

Para invertir el orden de búsqueda predeterminado, establezca esta directiva en 1.

Para establecer el valor de las preferencias de canales de lanzamiento, especifique un nombre de valor y un par de valor. Configure el nombre de valor en el id. del modelo de usuario de la aplicación o el nombre del archivo ejecutable. Puede usar el carácter comodín &quot;*&quot; como nombre de valor para aplicar a todas las aplicaciones.

Valor de ejemplo:

Name: *, Value: 1</string><string id="ReleaseChannelPreferenceDesc">Establecer las preferencias de orden de búsqueda por canales de lanzamiento (en desuso)</string><string id="ReleaseChannels">Configurar los canales de lanzamiento de WebView2</string><string id="ReleaseChannels_Explain">Esta directiva configura las opciones del canal de lanzamiento para las aplicaciones WebView2. Para configurar estas opciones, establezca el valor en una cadena de enteros separados por comas, que se asignan a los valores &quot;COREWEBVIEW2_RELEASE_CHANNELS&quot; de la API de WebView2 correspondiente. Estos valores son: WebView2 Runtime (0), Beta (1), Dev (2) y Canary (3). De forma predeterminada, la creación del entorno busca canales de más a menos estables, usando el primer canal que se encuentra en el dispositivo. Cuando se proporciona 'ReleaseChannels' (Configurar los canales de lanzamiento de WebView2), la creación del entorno solo buscará los canales especificados en el conjunto. Por ejemplo, los valores &quot;0,2&quot; y &quot;2,0&quot; indican que la creación del entorno solo debe buscar el canal de desarrollo y el tiempo de ejecución de WebView2, mediante el orden indicado por 'ChannelSearchKind' (Configurar el tipo de búsqueda del canal de versión WebView2). La creación del entorno intenta interpretar cada entero y trata cualquier entrada no válida como el canal estable. Establezca 'ChannelSearchKind' para invertir el orden de búsqueda para que la creación del entorno busque primero la compilación menos estable. Si se proporcionan 'BrowserExecutableFolder' (Configurar la ubicación de la carpeta ejecutable del explorador) y 'ReleaseChannels', 'BrowserExecutableFolder' tiene prioridad, independientemente de si el canal de 'BrowserExecutableFolder' se incluye en 'ReleaseChannels'.

Para establecer el valor de los canales de versión, proporcione un par de Nombre de valor y Valor. Establezca el nombre del valor en el identificador del modelo de usuario de la aplicación o en el nombre del archivo ejecutable. Puede usar el carácter comodín &quot;*&quot; como nombre de valor para aplicar a todas las aplicaciones.

Valor de ejemplo:

Name: WebView2APISample.exe, Value: 0,1,2</string><string id="ReleaseChannelsDesc">Configurar los canales de lanzamiento de WebView2</string><string id="Network_group">Configuración de red</string><string id="AccessControlAllowMethodsInCORSPreflightSpecConformant">Crear Access-Control-Allow-Methods coincidencia en CORS conformidad con las especificaciones preparatorias</string><string id="AccessControlAllowMethodsInCORSPreflightSpecConformant_Explain">Esta directiva controla si los métodos de solicitud se escriben en mayúsculas al coincidir con los encabezados de respuesta Access-Control-Allow-Methods en la versión preliminar de CORS.

Si se deshabilita esta directiva, los métodos de solicitud se mostrarán en mayúsculas. Este es el comportamiento en o antes de Microsoft Edge 108.

Si se habilita o no se configura esta directiva, los métodos de solicitud no se mostrarán en mayúsculas, a menos que coincidan entre mayúsculas y minúsculas con DELETE, GET, HEAD, OPTIONS, POST o PUT.

Esto rechazaría el encabezado de respuesta fetch(url, {method: 'Foo'}) + &quot;Access-Control-Allow-Methods: FOO&quot;,
y aceptaría el encabezado de respuesta fetch(url, {method: 'Foo'}) + &quot;Access-Control-Allow-Methods: Foo&quot;.

Nota: los métodos de solicitud &quot;post&quot; y &quot;put&quot; no se ven afectados, mientras que &quot;patch&quot; sí se ve afectado.

Esta directiva está pensada para ser temporal y se quitará en el futuro.</string><string id="BlockTruncatedCookies">Bloquear cookies truncadas (obsoleto)</string><string id="BlockTruncatedCookies_Explain">OBSOLETO: Esta directiva es obsoleta y no funciona después de la versión 131 de Microsoft Edge.

Esta directiva proporciona una opción de no participación temporal para los cambios en la forma en que Microsoft Edge administra las cookies establecidas mediante JavaScript que contienen determinados caracteres de control (NULL, retorno de carro y avance de línea).
Anteriormente, la presencia de cualquiera de estos caracteres en una cadena de cookie provocaría que se truncase, pero aún se establecería.
Ahora, la presencia de estos caracteres hará que se omitió toda la cadena de cookie.

Si habilita o no configura esta directiva, se habilitará el nuevo comportamiento.

Si deshabilita esta directiva, se habilita el comportamiento anterior.

Esta directiva está obsoleta porque se implementó originalmente como medida de seguridad en caso de interrupción, pero no se ha notificado ninguna.</string><string id="ZstdContentEncodingEnabled">Habilitar compatibilidad con la codificación de contenido de zstd</string><string id="ZstdContentEncodingEnabled_Explain">Esta característica habilita la compatibilidad con &quot;zstd&quot; publicitario en el encabezado de solicitud Accept-Encoding y la compatibilidad con la descompresión de contenido web de zstd.

Si habilita o no configura esta directiva, Microsoft Edge aceptará las respuestas del servidor comprimidas con zstd.

Si deshabilita esta directiva, la característica de codificación de contenidos zstd no se anunciará ni será compatible al procesar las respuestas del servidor.

Esta directiva es temporal y se quitará en el futuro.</string><string id="ExperimentationAndConfigurationServiceControl">Controlar la comunicación con el servicio de experimentación y configuración</string><string id="ExperimentationAndConfigurationServiceControl_Explain">El Servicio de experimentación y configuración se usa para implementar cargas de experimentación y configuración en el cliente.

La carga de experimentación consta de una lista de características de desarrollo temprano que Microsoft está habilitando para pruebas y comentarios.

La carga de configuración consta de una lista de opciones recomendadas que Microsoft quiere implementar para optimizar la experiencia del usuario.

La carga de configuración también puede contener una lista de acciones que se deben realizar en determinados dominios por motivos de compatibilidad. Por ejemplo, el explorador puede invalidar la cadena del agente de usuario en un sitio web si ese sitio web no funciona. Todas estas acciones son temporales hasta que Microsoft resuelva el problema con el propietario del sitio.

Si establece esta directiva en &quot;FullMode&quot;, la carga completa se descargará del servicio de experimentación y configuración. Esto incluye las cargas de experimentación y configuración.

Si establece esta directiva en &quot;ConfigurationsOnlyMode&quot;, solo se descargará la carga de configuración.

Si establece esta directiva en &quot;RestrictedMode&quot;, la comunicación con el servicio de experimentación y configuración se detiene por completo. Microsoft no recomienda esta configuración.

Si no configura esta directiva en un dispositivo administrado, el comportamiento en los canales Beta y Estable será el mismo que el de &quot;ConfigurationsOnlyMode&quot;. En los canales Canary y Dev, el comportamiento es el mismo que &quot;FullMode&quot;.

Si no configura esta directiva en un dispositivo no administrado, el comportamiento será el mismo que el de &quot;FullMode&quot;.

Asignación de opciones de directiva:

* FullMode (2) = Recuperar configuraciones y experimentos

* ConfigurationsOnlyMode (1) = Recuperar solo configuraciones

* RestrictedMode (0) = Deshabilitar la comunicación con el servicio de experimentación y configuración

Usa la información anterior al configurar esta directiva.</string><string id="ExperimentationAndConfigurationServiceControl_FullMode">Recuperar configuraciones y experimentos</string><string id="ExperimentationAndConfigurationServiceControl_ConfigurationsOnlyMode">Recuperar solo configuraciones</string><string id="ExperimentationAndConfigurationServiceControl_RestrictedMode">Deshabilitar la comunicación con el servicio de experimentación y configuración</string><string id="ForcePermissionPolicyUnloadDefaultEnabled">Controla si se pueden deshabilitar los controladores de eventos de unload.</string><string id="ForcePermissionPolicyUnloadDefaultEnabled_Explain">Los controladores de eventos de unload están obsoletos. Si se activan depende de la Permissions-Policy de unload.
Actualmente, la directiva los permite de forma predeterminada. En el futuro, gradualmente pasarán a no permitirse de forma predeterminada y los sitios deberán habilitarlos explícitamente usando los encabezados de la Permissions-Policy.
Esta política empresarial se puede utilizar para optar por no participar en esta desaprobación gradual obligando a que la opción predeterminada permanezca habilitada.

Las páginas pueden depender de los controladores de eventos de unload para guardar datos o señalar el final de una sesión de usuario al servidor.
Esto no se recomienda porque no es confiable y afecta el rendimiento al bloquear el uso de BackForwardCache.
Existen alternativas recomendadas, pero el evento de unload se ha utilizado durante mucho tiempo. Es posible que algunas aplicaciones aún dependan de ellos.

Si deshabilita esta política o no la configura, los controladores de eventos de unload quedarán obsoletos gradualmente en línea con la implementación de la obsolescencia y los sitios que no establezcan el encabezado de la Permissions-Policy, dejarán de activar eventos de &quot;descarga&quot;.

Si habilita esta política, los controladores de eventos de unload seguirán funcionando de forma predeterminada.</string><string id="HttpAllowlist">Lista de permitidos HTTP</string><string id="HttpAllowlist_Explain">Al establecer la directiva, se especifica una lista de nombres de host o patrones de nombre de host (como &quot;[*.]ejemplo.com&quot;) que no se actualizará a HTTPS y no mostrará errores intersticiales en caso de que el modo HTTPS-First esté habilitado. Las organizaciones pueden usar esta directiva para mantener el acceso a los servidores que no admitan HTTPS sin tener que deshabilitar &quot;AutomaticHttpsDefault&quot;.

Los nombres de host proporcionados deben ser canónicos: los IDN deben convertirse a su formato de etiqueta A y todas las letras ASCII deben estar en minúsculas.

No se permiten caracteres comodín de host abiertos (por ejemplo: &quot;*&quot; o &quot;[*]&quot;). En su lugar, el modo HTTPS-First y las actualizaciones HTTPS deben deshabilitarse explícitamente a través de sus directivas específicas.

Nota: esta directiva no se aplica a las actualizaciones de HSTS.

Valor de ejemplo:

testserver.example.com
[*.]example.org</string><string id="HttpAllowlistDesc">Lista de permitidos HTTP</string><string id="NewBaseUrlInheritanceBehaviorAllowed">Permite habilitar la característica NewBaseUrlInheritanceBehavior (en desuso)</string><string id="NewBaseUrlInheritanceBehaviorAllowed_Explain">EN DESUSO: esta directiva está en desuso. Actualmente se admite pero será obsoleta en una versión futura.

NewBaseUrlInheritanceBehavior es una característica Microsoft Edge que hace que los marcos about:blank y about:srcdoc hereden de forma coherente sus valores de dirección URL base mediante instantáneas de la dirección URL base del iniciador.

Si deshabilita esta directiva, impide que los usuarios o Microsoft Edge variaciones habiliten NewBaseUrlInheritanceBehavior, en caso de que se detecten problemas de compatibilidad.

Si habilita o no configura esta directiva, permite habilitar NewBaseUrlInheritanceBehavior.

Esta directiva está en desuso porque se ha quitado la característica NewBaseUrlInheritanceBehaviorAllowed.

Esta directiva estará obsoleta en la versión 133.</string><string id="NewPDFReaderWebView2List">Habilitar lector de PDF integrado con tecnología de Adobe Acrobat para WebView2</string><string id="NewPDFReaderWebView2List_Explain">Esta directiva configura las aplicaciones WebView2 para iniciar la nueva versión del lector de PDF con tecnología de Adobe Acrobat. El nuevo lector de PDF garantiza que no se pierda la funcionalidad y ofrece una experiencia de PDF mejorada. Esta experiencia incluye una representación más completa, un rendimiento mejorado, una seguridad sólida para el control de archivos PDF y una mayor accesibilidad.

Si se especifica esta directiva para una aplicación, es posible que también afecte a otras aplicaciones relacionadas. La directiva se aplica a todos los elementos WebView2 que comparten la misma carpeta de datos de usuario de WebView2. Estos elementos WebView2 podrían pertenecer a varias aplicaciones si esas aplicaciones, que probablemente pertenecen a la misma familia de productos, están diseñadas para compartir la misma carpeta de datos de usuario.

Use un par nombre-valor para habilitar el nuevo lector de PDF para la aplicación. Establezca el nombre en el identificador del modelo de usuario de la aplicación o en el nombre del archivo ejecutable. Puede usar el carácter comodín &quot;*&quot; como nombre de valor para aplicarlo a todas las aplicaciones. Establezca el valor en true para habilitar el nuevo lector o establézcalo en false para usar el existente.

Si habilita esta directiva para las aplicaciones WebView2 especificadas, usarán el nuevo lector de PDF con tecnología de Adobe Acrobat para abrir todos los archivos PDF.

Si deshabilita la directiva para las aplicaciones WebView2 especificadas o no la configura, usará el lector de PDF existente para abrir todos los archivos PDF.

Valor de ejemplo:

{&quot;name&quot;: &quot;app1.exe&quot;, &quot;value&quot;: true}
{&quot;name&quot;: &quot;app_id_for_app2&quot;, &quot;value&quot;: true}
{&quot;name&quot;: &quot;*&quot;, &quot;value&quot;: false}</string><string id="NewPDFReaderWebView2ListDesc">Habilitar lector de PDF integrado con tecnología de Adobe Acrobat para WebView2</string><string id="RSAKeyUsageForLocalAnchorsEnabled">Comprobación del uso de claves RSA para certificados de servidor emitidos por anclas de confianza locales (en desuso)</string><string id="RSAKeyUsageForLocalAnchorsEnabled_Explain">EN DESUSO: esta directiva está en desuso. Actualmente se admite pero será obsoleta en una versión futura.

Esta directiva está en desuso porque se ha quitado la característica RSAKeyUsageForLocalAnchorsEnabled.

Esta directiva se quitará en la versión 133.

La extensión de uso de claves X.509 declara cómo puede usarse la clave
de un certificado. Estas instrucciones garantizan que los certificados no se usan en un
contexto, que protege contra una clase de ataques de protocolo cruzado en HTTPS y
otros protocolos. Los clientes HTTPS deben comprobar que los certificados de servidor coinciden con los
parámetros TLS de la conexión.

A partir de Microsoft Edge 124, esta
comprobación está siempre habilitada.

Microsoft Edge 123 y anteriores tienen el
comportamiento siguiente:

Si esta directiva está habilitada,
Microsoft Edge realizará la comprobación
de esta clave. Esto ayuda a evitar ataques en los que un atacante manipula el explorador para que
interprete una clave de formas que el propietario del certificado no pretendía.

Si esta directiva se establece en deshabilitada,
Microsoft Edge omitirá esta comprobación de clave en las
conexiones HTTPS que negocian TLS 1.2 y usan un certificado RSA que
se encadene a un anclaje de veracidad local. Algunos ejemplos de anclajes de veracidad locales son
certificados raíz proporcionados por la directiva o instalados por el usuario. En todos los demás casos,
la comprobación se realiza independientemente de la configuración de esta directiva.

Si esta directiva no está configurada,
Microsoft Edge se comportará como si
la directiva estuviese habilitada.

Esta directiva está disponible para que los administradores obtengan una vista previa del comportamiento de una
versión futura, que habilitará esta comprobación de forma predeterminada. En ese momento, esta
directiva permanecerá disponible temporalmente para los administradores que necesiten más
tiempo para actualizar sus certificados para cumplir los nuevos requisitos de uso de claves RSA.

Las conexiones que no superen esta comprobación producirán el error
ERR_SSL_KEY_USAGE_INCOMPATIBLE. Es probable que los sitios con error con este error tengan un
certificado mal configurado. Los conjuntos de cifrado ECDHE_RSA modernos usan la
opción de uso de clave &quot;digitalSignature&quot;, mientras que los conjuntos de cifrado de descifrado RSA heredados
usan la opción de uso de clave &quot;keyEncipherment&quot;. Si no están seguros, los administradores deberían
incluir ambos en certificados RSA destinados a HTTPS.</string><string id="SUPPORTED_WIN7_V97">Microsoft Edge, versión 97, Windows 7 o posterior</string><string id="SUPPORTED_WIN7_V116">Microsoft Edge, versión 116, Windows 7 o posterior</string><string id="SUPPORTED_WIN7_V118">Microsoft Edge, versión 118, Windows 7 o posterior</string><string id="SUPPORTED_WIN7_V87">Microsoft Edge, versión 87, Windows 7 o posterior</string><string id="SUPPORTED_WIN7_V121">Microsoft Edge, versión 121, Windows 7 o posterior</string><string id="SUPPORTED_WIN7_V123">Microsoft Edge, versión 123, Windows 7 o posterior</string><string id="SUPPORTED_WIN7_V125">Microsoft Edge, versión 125, Windows 7 o posterior</string><string id="OBSOLETE_WIN7_V123_V131">Microsoft Edge versión 123-131, Windows 7 o una versión posterior.</string><string id="microsoft_edge_webview2">Microsoft Edge WebView2</string><string id="microsoft_edge_webview2_recommended">Microsoft Edge WebView2 - Configuración predeterminada (los usuarios pueden cambiarla)</string></stringTable><presentationTable><presentation id="BrowserExecutableFolder"><listBox refId="BrowserExecutableFolderDesc">Establece el nombre del valor en el identificador del modelo de usuario de la aplicación o en el nombre del archivo ejecutable. Puede usar el carácter comodín &quot;*&quot; como nombre de valor para aplicarlo a todas las aplicaciones.</listBox></presentation><presentation id="ChannelSearchKind"><listBox refId="ChannelSearchKindDesc">Establece el nombre del valor en el identificador del modelo de usuario de la aplicación o en el nombre del archivo ejecutable. Puede usar el carácter comodín &quot;*&quot; como nombre de valor para aplicarlo a todas las aplicaciones.</listBox></presentation><presentation id="ReleaseChannelPreference"><listBox refId="ReleaseChannelPreferenceDesc">Establece el nombre del valor en el identificador del modelo de usuario de la aplicación o en el nombre del archivo ejecutable. Puede usar el carácter comodín &quot;*&quot; como nombre de valor para aplicarlo a todas las aplicaciones.</listBox></presentation><presentation id="ReleaseChannels"><listBox refId="ReleaseChannelsDesc">Establece el nombre del valor en el identificador del modelo de usuario de la aplicación o en el nombre del archivo ejecutable. Puede usar el carácter comodín &quot;*&quot; como nombre de valor para aplicarlo a todas las aplicaciones.</listBox></presentation><presentation id="AccessControlAllowMethodsInCORSPreflightSpecConformant"/><presentation id="BlockTruncatedCookies"/><presentation id="ZstdContentEncodingEnabled"/><presentation id="ExperimentationAndConfigurationServiceControl"><dropdownList refId="ExperimentationAndConfigurationServiceControl">Controlar la comunicación con el servicio de experimentación y configuración</dropdownList></presentation><presentation id="ForcePermissionPolicyUnloadDefaultEnabled"/><presentation id="HttpAllowlist"><listBox refId="HttpAllowlistDesc">Lista de permitidos HTTP</listBox></presentation><presentation id="NewBaseUrlInheritanceBehaviorAllowed"/><presentation id="NewPDFReaderWebView2List"><listBox refId="NewPDFReaderWebView2ListDesc">Establece el nombre del valor en el identificador del modelo de usuario de la aplicación o en el nombre del archivo ejecutable. Puede usar el carácter comodín &quot;*&quot; como nombre de valor para aplicarlo a todas las aplicaciones.</listBox></presentation><presentation id="RSAKeyUsageForLocalAnchorsEnabled"/></presentationTable></resources></policyDefinitionResources>